In [1]:
import pandas as pd

Q1. **Goal of the Dataset:** GDP per capita and life expectancy

In [2]:
df = pd.read_csv("mckinsey.csv")
df

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   year        1704 non-null   int64
 2   population  1704 non-null   int64
 3   continent   1704 non-null   object
 4   life_exp    1704 non-null   float64
 5   gdp_cap     1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [4]:
df.describe()

             year    population     life_exp        gdp_cap
count  1704.00000  1.704000e+03  1704.000000    1704.000000
mean   1979.50000  2.960121e+07    59.474439    7215.327081
std      17.26533  1.061579e+08    12.917107    9857.454543
min    1952.00000  6.001100e+04    23.599000     241.165876
25%    1965.75000  2.793664e+06    48.198000    1202.060309
50%    1979.50000  7.023596e+06    60.712500    3531.846988
75%    1993.25000  1.958522e+07    70.845500    9325.462346
max    2007.00000  1.318683e+09    82.603000  113523.132900

In [5]:
df.describe(include="object")

            country continent
count          1704      1704
unique          142         5
top     Afghanistan    Africa
freq             12       624

Work with Columns

In [6]:
df["country"].value_counts() #output is series

Afghanistan          12
Pakistan             12
New Zealand          12
Nicaragua            12
Niger                12
                     ..
Eritrea              12
Equatorial Guinea    12
El Salvador          12
Egypt                12
Zimbabwe             12
Name: country, Length: 142, dtype: int64

In [7]:
type(df["country"].value_counts()) #here we have two values

pandas.core.series.Series

In [8]:
df["country"].value_counts().index #index can be non-numeric

Index(['Afghanistan', 'Pakistan', 'New Zealand', 'Nicaragua', 'Niger',
       'Nigeria', 'Norway', 'Oman', 'Panama', 'Nepal',
       ...
       'Gambia', 'Gabon', 'France', 'Finland', 'Ethiopia', 'Eritrea',
       'Equatorial Guinea', 'El Salvador', 'Egypt', 'Zimbabwe'],
      dtype='object', length=142)

Rename the column name

In [9]:
df.rename({'country':"Country"}, axis=1, inplace=True)

In [10]:
df

          Country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [11]:
#may be column name contain space
#my be column name contain number
#may be shape is the column name which is predefine variable

In [12]:
df.drop(["Country"], axis=1)

      year  population continent  life_exp     gdp_cap
0     1952     8425333      Asia    28.801  779.445314
1     1957     9240934      Asia    30.332  820.853030
2     1962    10267083      Asia    31.997  853.100710
3     1967    11537966      Asia    34.020  836.197138
4     1972    13079460      Asia    36.088  739.981106
...    ...         ...       ...       ...         ...
1699  1987     9216418    Africa    62.351  706.157306
1700  1992    10704340    Africa    60.377  693.420786
1701  1997    11404948    Africa    46.809  792.449960
1702  2002    11926563    Africa    39.989  672.038623
1703  2007    12311143    Africa    43.487  469.709298

[1704 rows x 5 columns]

In [13]:
df['custom'] = [i for i in range(1704)]
df

          Country  year  population continent  life_exp     gdp_cap  custom
0     Afghanistan  1952     8425333      Asia    28.801  779.445314       0
1     Afghanistan  1957     9240934      Asia    30.332  820.853030       1
2     Afghanistan  1962    10267083      Asia    31.997  853.100710       2
3     Afghanistan  1967    11537966      Asia    34.020  836.197138       3
4     Afghanistan  1972    13079460      Asia    36.088  739.981106       4
...           ...   ...         ...       ...       ...         ...     ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306    1699
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786    1700
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960    1701
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623    1702
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298    1703

[1704 rows x 7 columns]

In [14]:
df.drop(['custom'], axis=1, inplace=True)
df

          Country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

Working with row

In [15]:
ser = df['Country']
ser

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: Country, Length: 1704, dtype: object

In [16]:
ser[3]

'Afghanistan'

In [17]:
ser[4:16] #Slicing
df['Country'][4:16]

4     Afghanistan
5     Afghanistan
6     Afghanistan
7     Afghanistan
8     Afghanistan
9     Afghanistan
10    Afghanistan
11    Afghanistan
12        Albania
13        Albania
14        Albania
15        Albania
Name: Country, dtype: object

In [18]:
ser.index

RangeIndex(start=0, stop=1704, step=1)

In [19]:
import numpy as np
ser.index = np.arange(1, df.shape[0]+1, 1)
ser

1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
5       Afghanistan
           ...
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
1704       Zimbabwe
Name: Country, Length: 1704, dtype: object

positional indexes - implicit indexes, always Start from 0 and end with number<br>
visible indexes -  explicit indexes, any indexes

In [20]:
ser.index

Int64Index([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,
            ...
            1695, 1696, 1697, 1698, 1699, 1700, 1701, 1702, 1703, 1704],
           dtype='int64', length=1704)

In [21]:
data = pd.Series(['a','b','c'], index=[1,3,5])
data

1    a
3    b
5    c
dtype: object

In [22]:
#indexing
data[1], data[3] #using explicit indexes

('a', 'b')

In [23]:
#slicing
data[1:3] #unsing implicit indexing

C:\Users\visha\AppData\Local\Temp\ipykernel_10516\1623602752.py:2: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  data[1:3] #unsing implicit indexing

3    b
5    c
dtype: object

In [24]:
data = pd.Series(['a','b','c'], index=["x", "y", "z"])
data

x    a
y    b
z    c
dtype: object

In [25]:
data['x'] #indexing using positinal indexing

'a'

In [26]:
#to Avoid the confusion Pandas has Special Indexes
#1. loc - work with explicit indexes/labels <br>
#2. iloc - works with implicit indexes/posistional indexes

In [27]:
data.loc["x"], data.iloc[0]

('a', 'a')

In [28]:
data.loc["y"], data.iloc[1]

('b', 'b')

In [29]:
data.loc["z"], data.iloc[2]

('c', 'c')

In [31]:
df.iloc[[1,10,100]]

         Country  year  population continent  life_exp     gdp_cap
1    Afghanistan  1957     9240934      Asia    30.332  820.853030
10   Afghanistan  2002    25268405      Asia    42.129  726.734055
100   Bangladesh  1972    70759295      Asia    45.252  630.233627

In [33]:
df.loc[[1,10,100]] #indexes is same that is why answer is same for loc and iloc

         Country  year  population continent  life_exp     gdp_cap
1    Afghanistan  1957     9240934      Asia    30.332  820.853030
10   Afghanistan  2002    25268405      Asia    42.129  726.734055
100   Bangladesh  1972    70759295      Asia    45.252  630.233627

In [37]:
df.iloc[-1] #implicit location
#df.loc[-1] gives error

Country         Zimbabwe
year                2007
population      12311143
continent         Africa
life_exp          43.487
gdp_cap       469.709298
Name: 1703, dtype: object

In [39]:
#convert country to indexd/row label
temp = df.set_index("Country")
temp.head(3)

             year  population continent  life_exp     gdp_cap
Country
Afghanistan  1952     8425333      Asia    28.801  779.445314
Afghanistan  1957     9240934      Asia    30.332  820.853030
Afghanistan  1962    10267083      Asia    31.997  853.100710

In [40]:
temp.loc["Afghanistan"]

             year  population continent  life_exp     gdp_cap
Country
Afghanistan  1952     8425333      Asia    28.801  779.445314
Afghanistan  1957     9240934      Asia    30.332  820.853030
Afghanistan  1962    10267083      Asia    31.997  853.100710
Afghanistan  1967    11537966      Asia    34.020  836.197138
Afghanistan  1972    13079460      Asia    36.088  739.981106
Afghanistan  1977    14880372      Asia    38.438  786.113360
Afghanistan  1982    12881816      Asia    39.854  978.011439
Afghanistan  1987    13867957      Asia    40.822  852.395945
Afghanistan  1992    16317921      Asia    41.674  649.341395
Afghanistan  1997    22227415      Asia    41.763  635.341351
Afghanistan  2002    25268405      Asia    42.129  726.734055
Afghanistan  2007    31889923      Asia    43.828  974.580338

In [43]:
temp.iloc[:12]

             year  population continent  life_exp     gdp_cap
Country
Afghanistan  1952     8425333      Asia    28.801  779.445314
Afghanistan  1957     9240934      Asia    30.332  820.853030
Afghanistan  1962    10267083      Asia    31.997  853.100710
Afghanistan  1967    11537966      Asia    34.020  836.197138
Afghanistan  1972    13079460      Asia    36.088  739.981106
Afghanistan  1977    14880372      Asia    38.438  786.113360
Afghanistan  1982    12881816      Asia    39.854  978.011439
Afghanistan  1987    13867957      Asia    40.822  852.395945
Afghanistan  1992    16317921      Asia    41.674  649.341395
Afghanistan  1997    22227415      Asia    41.763  635.341351
Afghanistan  2002    25268405      Asia    42.129  726.734055
Afghanistan  2007    31889923      Asia    43.828  974.580338

In [45]:
temp["life_exp"].loc["Zimbabwe"]

Country
Zimbabwe    48.451
Zimbabwe    50.469
Zimbabwe    52.358
Zimbabwe    53.995
Zimbabwe    55.635
Zimbabwe    57.674
Zimbabwe    60.363
Zimbabwe    62.351
Zimbabwe    60.377
Zimbabwe    46.809
Zimbabwe    39.989
Zimbabwe    43.487
Name: life_exp, dtype: float64

In [47]:
d = {'Country':'India', 'year':2023, 'population':1.5, 'continent':'Asia', 'life_exp':75, 'gdp_cap':200}
d

{'Country': 'India',
 'year': 2023,
 'population': 1.5,
 'continent': 'Asia',
 'life_exp': 75,
 'gdp_cap': 200}

In [49]:
df.append(d, ignore_index=True) #ignore the index of d.

C:\Users\visha\AppData\Local\Temp\ipykernel_10516\3662875788.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(d, ignore_index=True)

          Country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952   8425333.0      Asia    28.801  779.445314
1     Afghanistan  1957   9240934.0      Asia    30.332  820.853030
2     Afghanistan  1962  10267083.0      Asia    31.997  853.100710
3     Afghanistan  1967  11537966.0      Asia    34.020  836.197138
4     Afghanistan  1972  13079460.0      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1700     Zimbabwe  1992  10704340.0    Africa    60.377  693.420786
1701     Zimbabwe  1997  11404948.0    Africa    46.809  792.449960
1702     Zimbabwe  2002  11926563.0    Africa    39.989  672.038623
1703     Zimbabwe  2007  12311143.0    Africa    43.487  469.709298
1704        India  2023         1.5      Asia    75.000  200.000000

[1705 rows x 6 columns]

In [57]:
df.loc[len(df.index)] = ["India", 2022, 1350000, "Asia", 75, 500]  #iloc will not add the value

In [58]:
df

          Country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298
1704        India  2022     1350000      Asia    75.000  500.000000
1705        India  2022     1350000      Asia    75.000  500.000000
1706        India  2022     1350000      Asia    75.000  500.000000

[1707 rows x 6 columns]

**Drop Rows**

In [61]:
df.loc[df.duplicated()]

     Country  year  population continent  life_exp  gdp_cap
1705   India  2022     1350000      Asia      75.0    500.0
1706   India  2022     1350000      Asia      75.0    500.0

In [64]:
df.drop_duplicates(keep="first")

          Country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298
1704        India  2022     1350000      Asia    75.000  500.000000

[1705 rows x 6 columns]

In [67]:
df.drop([1706], axis=0, inplace=True)

**Work with Rows and Columns: Slicing**

In [69]:
df.iloc[1:5, :4]

       Country  year  population continent
1  Afghanistan  1957     9240934      Asia
2  Afghanistan  1962    10267083      Asia
3  Afghanistan  1967    11537966      Asia
4  Afghanistan  1972    13079460      Asia

In [77]:
df.iloc[[0,10,100],[0,1,2]]

         Country  year  population
0    Afghanistan  1952     8425333
10   Afghanistan  2002    25268405
100   Bangladesh  1972    70759295

In [70]:
df.head(3)

       Country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710

In [76]:
df.loc[1:5, "Country":"life_exp"]  #5 ia also included

       Country  year  population continent  life_exp
1  Afghanistan  1957     9240934      Asia    30.332
2  Afghanistan  1962    10267083      Asia    31.997
3  Afghanistan  1967    11537966      Asia    34.020
4  Afghanistan  1972    13079460      Asia    36.088
5  Afghanistan  1977    14880372      Asia    38.438

In [79]:
print(df['life_exp'].mean())
print(df['life_exp'].sum())
print(df['life_exp'].count())

59.49264049237983
101494.44467999999
1706

In [84]:
df.sort_values(["year"], ascending=False)

             Country  year  population continent  life_exp       gdp_cap
1705           India  2022     1350000      Asia    75.000    500.000000
1704           India  2022     1350000      Asia    75.000    500.000000
1523        Tanzania  2007    38139640    Africa    52.517   1107.482182
755          Ireland  2007     4109086    Europe    78.885  40675.996350
1451           Sudan  2007    42292929    Africa    58.556   2602.394995
...              ...   ...         ...       ...       ...           ...
612           Guinea  1952     2664249    Africa    33.609    510.196492
1596  United Kingdom  1952    50430000    Europe    69.180   9979.508487
1164        Pakistan  1952    41346560      Asia    43.436    684.597144
600        Guatemala  1952     3146381  Americas    42.023   2428.237769
0        Afghanistan  1952     8425333      Asia    28.801    779.445314

[1706 rows x 6 columns]

In [86]:
df.sort_values(["year", "life_exp"], ascending=[False, True])

          Country  year  population continent  life_exp       gdp_cap
1704        India  2022     1350000      Asia    75.000    500.000000
1705        India  2022     1350000      Asia    75.000    500.000000
1463    Swaziland  2007     1133066    Africa    39.613   4513.480643
1043   Mozambique  2007    19951656    Africa    42.082    823.685621
1691       Zambia  2007    11746035    Africa    42.384   1271.211593
...           ...   ...         ...       ...       ...           ...
408       Denmark  1952     4334000    Europe    70.780   9692.385245
1464       Sweden  1952     7124673    Europe    71.860   8527.844662
1080  Netherlands  1952    10381988    Europe    72.130   8941.571858
684       Iceland  1952      147962    Europe    72.490   7267.688428
1140       Norway  1952     3327728    Europe    72.670  10095.421720

[1706 rows x 6 columns]

In [87]:
#Create a Series
pd.Series([10,20,30], index=["a","b","c"])

a    10
b    20
c    30
dtype: int64

In [88]:
#Create Dataframe
#1 - Row Oriented
pd.DataFrame([[10,20], [30,40]], columns=["A", "B"])

    A   B
0  10  20
1  30  40

In [89]:
#2. Column Orriented Approch
pd.DataFrame({"A":[10,20], "B":[30,40]})

    A   B
0  10  30
1  20  40

# Lecture 2

In [3]:
import numpy as np
import pandas as pd

In [51]:
movies = pd.read_csv('movies.csv', index_col=0)
movies.head(4)

,id,budget,popularity,revenue,title,vote_average,vote_count,director_id,year,month,day
0,43597,237000000,150,2787965087,Avatar,7.2,11800,4762,2009,Dec,Thursday
1,43598,300000000,139,961000000,Pirates of the Caribbean: At World's End,6.9,4500,4763,2007,May,Saturday
2,43599,245000000,107,880674609,Spectre,6.3,4466,4764,2015,Oct,Monday
3,43600,250000000,112,1084939099,The Dark Knight Rises,7.6,9106,4765,2012,Jul,Monday

Q1. Top 10 most popular movie

Q2. Number of movie relese per year

Q3. Highest budget movie per year or till now

Q4. Hard - which dictore produes highest product movie.

Q5. Highest and lowest budget movie per month

In [52]:
directors = pd.read_csv('directors.csv', index_col=0)
directors.head()

       director_name    id gender
0      James Cameron  4762   Male
1     Gore Verbinski  4763   Male
2         Sam Mendes  4764   Male
3  Christopher Nolan  4765   Male
4     Andrew Stanton  4766   Male

Concatination

In [7]:
a = pd.DataFrame({'A':[10,30], 'B':[20,40]})
b = pd.DataFrame({'A':[10,30], 'C':[20,40]})

In [8]:
a

    A   B
0  10  20
1  30  40

In [9]:
b

    A   C
0  10  20
1  30  40

In [13]:
pd.concat([a,b], axis=0)

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [16]:
pd.concat([a,b], axis=1)

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [17]:
pd.concat([a,b], axis=1, ignore_index=True)

    0   1   2   3
0  10  20  10  20
1  30  40  30  40

In [18]:
pd.concat([a,b], axis=0, ignore_index=True)

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
2  10   NaN  20.0
3  30   NaN  40.0

In [20]:
pd.concat([a,b], keys=["X", "Y"]) #2 Level Indexing

      A     B     C
X 0  10  20.0   NaN
  1  30  40.0   NaN
Y 0  10   NaN  20.0
  1  30   NaN  40.0

In [23]:
print(pd.concat([a,b], keys=["X", "Y"]).loc['X'])
print(pd.concat([a,b], keys=["X", "Y"]).loc['Y'])

    A     B   C
0  10  20.0 NaN
1  30  40.0 NaN
    A   B     C
0  10 NaN  20.0
1  30 NaN  40.0

Inner Contination - Joining of two table
>Inner Join

In [27]:
pd.concat([a,b], axis=0)

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [30]:
pd.concat([a,b], axis=1, join='inner')

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [29]:
pd.concat([a,b], axis=0, join='outer')

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

>Left Outer join <br>
>Right Outer join

Merge

In [31]:
users = pd.DataFrame({'userid':[1,2,3], 'name':["A", "B", "C"]})
msgs = pd.DataFrame({'userid':[1,1,2], 'msg':["hello", "Bye", "Cat"]})

In [33]:
print(users)
print(msgs)

   userid name
0       1    A
1       2    B
2       3    C
   userid    msg
0       1  hello
1       1    Bye
2       2    Cat

In [35]:
pd.concat([users, msgs], axis=1)

   userid name  userid    msg
0       1    A       1  hello
1       2    B       1    Bye
2       3    C       2    Cat

In [37]:
msgs.merge(users, on='userid')

   userid    msg name
0       1  hello    A
1       1    Bye    A
2       2    Cat    B

In [38]:
users.merge(msgs, on='userid')

   userid name    msg
0       1    A  hello
1       1    A    Bye
2       2    B    Cat

In [43]:
users = pd.DataFrame({'id':[1,2,3], 'name':["A", "B", "C"]})
msgs = pd.DataFrame({'userid':[1,1,2], 'msg':["hello", "Bye", "Cat"]})

In [44]:
users.merge(msgs, left_on='id', right_on='userid')

   id name  userid    msg
0   1    A       1  hello
1   1    A       1    Bye
2   2    B       2    Cat

In [45]:
#inner
users.merge(msgs, left_on='id', right_on='userid', how='inner')

   id name  userid    msg
0   1    A       1  hello
1   1    A       1    Bye
2   2    B       2    Cat

In [46]:
#outer
users.merge(msgs, left_on='id', right_on='userid', how='outer')

   id name  userid    msg
0   1    A     1.0  hello
1   1    A     1.0    Bye
2   2    B     2.0    Cat
3   3    C     NaN    NaN

In [48]:
#left
users.merge(msgs, left_on='id', right_on='userid', how='left')

   id name  userid    msg
0   1    A     1.0  hello
1   1    A     1.0    Bye
2   2    B     2.0    Cat
3   3    C     NaN    NaN

In [49]:
#right
users.merge(msgs, left_on='id', right_on='userid', how='right')

   id name  userid    msg
0   1    A       1  hello
1   1    A       1    Bye
2   2    B       2    Cat

In [55]:
movies.merge(directors, left_on='director_id', right_on='id', how='left')

,id_x,budget,popularity,revenue,title,vote_average,vote_count,director_id,year,month,day,director_name,id_y,gender
0,43597,237000000,150,2787965087,Avatar,7.2,11800,4762,2009,Dec,Thursday,James Cameron,4762,Male
1,43598,300000000,139,961000000,Pirates of the Caribbean: At World's End,6.9,4500,4763,2007,May,Saturday,Gore Verbinski,4763,Male
2,43599,245000000,107,880674609,Spectre,6.3,4466,4764,2015,Oct,Monday,Sam Mendes,4764,Male
3,43600,250000000,112,1084939099,The Dark Knight Rises,7.6,9106,4765,2012,Jul,Monday,Christopher Nolan,4765,Male
4,43602,258000000,115,890871626,Spider-Man 3,5.9,3576,4767,2007,May,Tuesday,Sam Raimi,4767,Male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1460,48363,0,3,321952,The Last Waltz,7.9,64,4809,1978,May,Monday,Martin Scorsese,4809,Male
1461,48370,27000,19,3151130,Clerks,7.4,755,5369,1994,Sep,Tuesday,Kevin Smith,5369,Male
1462,48375,0,7,0,Rampage,6.0,131,5148,2009,Aug,Friday,Uwe Boll,5148,Male
1463,48376,0,3,0,Slacker,6.4,77,5535,1990,Jul,Friday,Richard Linklater,5535,Male
1464,48395,220000,14,2040920,El Mariachi,6.6,238,5097,1992,Sep,Friday,Robert Rodriguez,5097,NaN

In [59]:
movies['director_id'].nunique()

199

In [60]:
movies['director_id'].isin(directors['id'])

0       True
1       True
2       True
3       True
5       True
        ...
4736    True
4743    True
4748    True
4749    True
4768    True
Name: director_id, Length: 1465, dtype: bool

In [61]:
np.all(movies['director_id'].isin(directors['id']))

True

In [63]:
data = movies.merge(directors, left_on='director_id', right_on='id', how='left')
data.head(5)

,id_x,budget,popularity,revenue,title,vote_average,vote_count,director_id,year,month,day,director_name,id_y,gender
0,43597,237000000,150,2787965087,Avatar,7.2,11800,4762,2009,Dec,Thursday,James Cameron,4762,Male
1,43598,300000000,139,961000000,Pirates of the Caribbean: At World's End,6.9,4500,4763,2007,May,Saturday,Gore Verbinski,4763,Male
2,43599,245000000,107,880674609,Spectre,6.3,4466,4764,2015,Oct,Monday,Sam Mendes,4764,Male
3,43600,250000000,112,1084939099,The Dark Knight Rises,7.6,9106,4765,2012,Jul,Monday,Christopher Nolan,4765,Male
4,43602,258000000,115,890871626,Spider-Man 3,5.9,3576,4767,2007,May,Tuesday,Sam Raimi,4767,Male

In [66]:
data.drop(['director_id', 'id_y'], axis=1, inplace=True)

In [67]:
data.head()

,id_x,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
0,43597,237000000,150,2787965087,Avatar,7.2,11800,2009,Dec,Thursday,James Cameron,Male
1,43598,300000000,139,961000000,Pirates of the Caribbean: At World's End,6.9,4500,2007,May,Saturday,Gore Verbinski,Male
2,43599,245000000,107,880674609,Spectre,6.3,4466,2015,Oct,Monday,Sam Mendes,Male
3,43600,250000000,112,1084939099,The Dark Knight Rises,7.6,9106,2012,Jul,Monday,Christopher Nolan,Male
4,43602,258000000,115,890871626,Spider-Man 3,5.9,3576,2007,May,Tuesday,Sam Raimi,Male

In [68]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1465 entries, 0 to 1464
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id_x           1465 non-null   int64
 1   budget         1465 non-null   int64
 2   popularity     1465 non-null   int64
 3   revenue        1465 non-null   int64
 4   title          1465 non-null   object
 5   vote_average   1465 non-null   float64
 6   vote_count     1465 non-null   int64
 7   year           1465 non-null   int64
 8   month          1465 non-null   object
 9   day            1465 non-null   object
 10  director_name  1465 non-null   object
 11  gender         1341 non-null   object
dtypes: float64(1), int64(6), object(5)
memory usage: 181.1+ KB

In [69]:
data.describe()

,id_x,budget,popularity,revenue,vote_average,vote_count,year
count,1465.000000,1.465000e+03,1465.000000,1.465000e+03,1465.000000,1465.000000,1465.000000
mean,45225.191126,4.802295e+07,30.855973,1.432539e+08,6.368191,1146.396587,2002.615017
std,1189.096396,4.935541e+07,34.845214,2.064918e+08,0.818033,1578.077438,8.680141
min,43597.000000,0.000000e+00,0.000000,0.000000e+00,3.000000,1.000000,1976.000000
25%,44236.000000,1.400000e+07,11.000000,1.738013e+07,5.900000,216.000000,1998.000000
50%,45022.000000,3.300000e+07,23.000000,7.578164e+07,6.400000,571.000000,2004.000000
75%,45990.000000,6.600000e+07,41.000000,1.792469e+08,6.900000,1387.000000,2009.000000
max,48395.000000,3.800000e+08,724.000000,2.787965e+09,8.300000,13752.000000,2016.000000

In [70]:
data.describe(include='object')

         title month     day     director_name gender
count     1465  1465    1465              1465   1341
unique    1465    12       7               199      2
top     Avatar   Dec  Friday  Steven Spielberg   Male
freq         1   193     654                26   1309

In [73]:
data['revenue'] = data['revenue']/1000000
data['budget'] = data['budget']/1000000

In [74]:
data.head(4)

,id_x,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
0,43597,237.0,150,2787.965087,Avatar,7.2,11800,2009,Dec,Thursday,James Cameron,Male
1,43598,300.0,139,961.000000,Pirates of the Caribbean: At World's End,6.9,4500,2007,May,Saturday,Gore Verbinski,Male
2,43599,245.0,107,880.674609,Spectre,6.3,4466,2015,Oct,Monday,Sam Mendes,Male
3,43600,250.0,112,1084.939099,The Dark Knight Rises,7.6,9106,2012,Jul,Monday,Christopher Nolan,Male

Q1. Fetch Highly reated move (rating > 8)

In [79]:
data.loc[data['vote_average'] >= 8].head(3)

,id_x,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
45,43662,185.0,187,1004.558444,The Dark Knight,8.2,12002,2008,Jul,Wednesday,Christopher Nolan,Male
58,43692,165.0,724,675.120017,Interstellar,8.1,10867,2014,Nov,Wednesday,Christopher Nolan,Male
59,43693,160.0,167,825.532764,Inception,8.1,13752,2010,Jul,Wednesday,Christopher Nolan,Male

In [81]:
data.loc[data['vote_average'] >= 8, ['title', 'vote_average']].head(3)

              title  vote_average
45  The Dark Knight           8.2
58     Interstellar           8.1
59        Inception           8.1

Q2. Find all the leatest highly reated movie.
>How I define highly reated movies are: a). any move greater then rate 8 and release at after near 2015.

In [91]:
mask1 = data['year'] >= 2015
mask2 = data['vote_average'] >= 7
data.loc[mask1 & mask2].head()

,id_x,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
30,43641,190.0,102,1506.249360,Furious 7,7.3,4176,2015,Apr,Wednesday,James Wan,Male
78,43724,150.0,434,378.858340,Mad Max: Fury Road,7.2,9427,2015,May,Wednesday,George Miller,Male
106,43773,135.0,100,532.950503,The Revenant,7.3,6396,2015,Dec,Friday,Alejandro GonzÃ¡lez IÃ±Ã¡rritu,Male
162,43867,108.0,167,630.161890,The Martian,7.6,7268,2015,Sep,Wednesday,Ridley Scott,Male
312,44128,75.0,48,108.145109,The Man from U.N.C.L.E.,7.1,2265,2015,Aug,Thursday,Guy Ritchie,Male

Q3. List all movie that listed batasmen in there name?

String methods - startswith, contains

In [94]:
data.loc[data['title'] == 'Batman']

,id_x,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
704,44956,35.0,44,411.348924,Batman,7.0,2096,1989,Jun,Friday,Tim Burton,Male

In [101]:
data.loc[data['title'].str.contains('Batman')].head(3)

,id_x,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
5,43606,250.0,155,873.260194,Batman v Superman: Dawn of Justice,5.7,7004,2016,Mar,Wednesday,Zack Snyder,Male
74,43716,150.0,115,374.218673,Batman Begins,7.5,7359,2005,Jun,Friday,Christopher Nolan,Male
128,43807,125.0,50,238.207122,Batman & Robin,4.2,1418,1997,Jun,Friday,Joel Schumacher,Male

In [100]:
data.loc[data['title'].str.startswith('The')].head(3)

,id_x,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
3,43600,250.0,112,1084.939099,The Dark Knight Rises,7.6,9106,2012,Jul,Monday,Christopher Nolan,Male
9,43610,255.0,49,89.289910,The Lone Ranger,5.9,2311,2013,Jul,Wednesday,Gore Verbinski,Male
11,43612,225.0,53,419.651413,The Chronicles of Narnia: Prince Caspian,6.3,1630,2008,May,Thursday,Andrew Adamson,Male

Q4. Top most 5 popular movies
>here we don't know the parameter of popularity so we sort it and get the 5 top value.

In [104]:
data.sort_values('popularity', ascending=False).head(5)

,id_x,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
58,43692,165.0,724,675.120017,Interstellar,8.1,10867,2014,Nov,Wednesday,Christopher Nolan,Male
78,43724,150.0,434,378.858340,Mad Max: Fury Road,7.2,9427,2015,May,Wednesday,George Miller,Male
119,43796,140.0,271,655.011224,Pirates of the Caribbean: The Curse of the Bla...,7.5,6985,2003,Jul,Wednesday,Gore Verbinski,Male
120,43797,125.0,206,752.100229,The Hunger Games: Mockingjay - Part 1,6.6,5584,2014,Nov,Tuesday,Francis Lawrence,Male
45,43662,185.0,187,1004.558444,The Dark Knight,8.2,12002,2008,Jul,Wednesday,Christopher Nolan,Male

Q5. find the movie of director christoper Nolan.

In [110]:
data.loc[data['director_name'] == 'Christopher Nolan', "title"]

3       The Dark Knight Rises
45            The Dark Knight
58               Interstellar
59                  Inception
74              Batman Begins
565                  Insomnia
641              The Prestige
1341                  Memento
Name: title, dtype: object

In [111]:
data.loc[data['director_name'] == 'Christopher Nolan', "title"].count()

8

Q5. How many movie created by director

In [113]:
data['director_name'].value_counts()

Steven Spielberg      26
Martin Scorsese       19
Clint Eastwood        19
Woody Allen           18
Ridley Scott          16
                      ..
Tim Hill               5
Jonathan Liebesman     5
Roman Polanski         5
Larry Charles          5
Nicole Holofcener      5
Name: director_name, Length: 199, dtype: int64

In [118]:
data.groupby('director_name')['title'].count()

director_name
Adam McKay                      6
Adam Shankman                   8
Alejandro GonzÃ¡lez IÃ±Ã¡rritu     6
Alex Proyas                     5
Alexander Payne                 5
                               ..
Wes Craven                     10
Wolfgang Petersen               7
Woody Allen                    18
Zack Snyder                     7
Zhang Yimou                     6
Name: title, Length: 199, dtype: int64

Q6. Get me the heightest budget movie of each and every director.
>highest bedget movie of Adam McKay is 100.

In [117]:
data.groupby('director_name')['budget'].max()

director_name
Adam McKay                     100.0
Adam Shankman                   80.0
Alejandro GonzÃ¡lez IÃ±Ã¡rritu    135.0
Alex Proyas                    140.0
Alexander Payne                 30.0
                               ...
Wes Craven                      40.0
Wolfgang Petersen              175.0
Woody Allen                     30.0
Zack Snyder                    250.0
Zhang Yimou                     94.0
Name: budget, Length: 199, dtype: float64

Q7. Which Director is the most productive Directors?
>how to analyse who is more productive on the basis of what parameter? <br>
>there are different ways like how many award a director have got or heighest bedget movie of all time or number of movie directed per year etc

>let take it simple lets say number of movie directed by a director is the most productive.

In [121]:
# number of movie
# quality - vote average

In [123]:
data["director_name"].value_counts()

Steven Spielberg      26
Martin Scorsese       19
Clint Eastwood        19
Woody Allen           18
Ridley Scott          16
                      ..
Tim Hill               5
Jonathan Liebesman     5
Roman Polanski         5
Larry Charles          5
Nicole Holofcener      5
Name: director_name, Length: 199, dtype: int64

In [124]:
data.groupby('director_name')['title'].count().sort_values(ascending=False)

director_name
Steven Spielberg    26
Clint Eastwood      19
Martin Scorsese     19
Woody Allen         18
Robert Rodriguez    16
                    ..
Paul Weitz           5
John Madden          5
Paul Verhoeven       5
John Whitesell       5
Kevin Reynolds       5
Name: title, Length: 199, dtype: int64

In [129]:
#Average number of movie directed per year 
#active year = min year - max year of director

In [127]:
data.groupby('director_name')['year'].min()

director_name
Adam McKay                     2004
Adam Shankman                  2001
Alejandro GonzÃ¡lez IÃ±Ã¡rritu    2000
Alex Proyas                    1994
Alexander Payne                1999
                               ...
Wes Craven                     1984
Wolfgang Petersen              1981
Woody Allen                    1977
Zack Snyder                    2004
Zhang Yimou                    2002
Name: year, Length: 199, dtype: int64

In [128]:
data.groupby('director_name')['year'].max()

director_name
Adam McKay                     2015
Adam Shankman                  2012
Alejandro GonzÃ¡lez IÃ±Ã¡rritu    2015
Alex Proyas                    2016
Alexander Payne                2013
                               ...
Wes Craven                     2011
Wolfgang Petersen              2006
Woody Allen                    2013
Zack Snyder                    2016
Zhang Yimou                    2014
Name: year, Length: 199, dtype: int64

In [151]:
df_agg = data.groupby('director_name')[['year', 'title']].aggregate(
    {'year':['min', 'max'], 'title':'count'})
df_agg

                             year       title
                              min   max count
director_name
Adam McKay                   2004  2015     6
Adam Shankman                2001  2012     8
Alejandro GonzÃ¡lez IÃ±Ã¡rritu  2000  2015     6
Alex Proyas                  1994  2016     5
Alexander Payne              1999  2013     5
...                           ...   ...   ...
Wes Craven                   1984  2011    10
Wolfgang Petersen            1981  2006     7
Woody Allen                  1977  2013    18
Zack Snyder                  2004  2016     7
Zhang Yimou                  2002  2014     6

[199 rows x 3 columns]

In [152]:
df_agg.columns #multi index columns

MultiIndex([( 'year',   'min'),
            ( 'year',   'max'),
            ('title', 'count')],
           )

In [153]:
#convert multi index into 1 level index
df_agg.columns = ["_".join(col) for col in df_agg.columns]
df_agg.columns

Index(['year_min', 'year_max', 'title_count'], dtype='object')

In [156]:
df_agg

                             year_min  year_max  title_count
director_name
Adam McKay                       2004      2015            6
Adam Shankman                    2001      2012            8
Alejandro GonzÃ¡lez IÃ±Ã¡rritu      2000      2015            6
Alex Proyas                      1994      2016            5
Alexander Payne                  1999      2013            5
...                               ...       ...          ...
Wes Craven                       1984      2011           10
Wolfgang Petersen                1981      2006            7
Woody Allen                      1977      2013           18
Zack Snyder                      2004      2016            7
Zhang Yimou                      2002      2014            6

[199 rows x 3 columns]

In [157]:
df_agg.reset_index(inplace=True)

In [162]:
df_agg

,director_name,year_min,year_max,title_count,active_yrs,movie_per_year
0,Adam McKay,2004,2015,6,11,0.545455
1,Adam Shankman,2001,2012,8,11,0.727273
2,Alejandro GonzÃ¡lez IÃ±Ã¡rritu,2000,2015,6,15,0.400000
3,Alex Proyas,1994,2016,5,22,0.227273
4,Alexander Payne,1999,2013,5,14,0.357143
...,...,...,...,...,...,...
194,Wes Craven,1984,2011,10,27,0.370370
195,Wolfgang Petersen,1981,2006,7,25,0.280000
196,Woody Allen,1977,2013,18,36,0.500000
197,Zack Snyder,2004,2016,7,12,0.583333
198,Zhang Yimou,2002,2014,6,12,0.500000

In [159]:
df_agg['active_yrs'] = (df_agg['year_max'] - df_agg['year_min'])

In [161]:
df_agg['movie_per_year'] = df_agg['title_count']/df_agg['active_yrs']

In [165]:
df_agg.sort_values('movie_per_year', ascending=False).head()

,director_name,year_min,year_max,title_count,active_yrs,movie_per_year
190,Tyler Perry,2006,2013,9,7,1.285714
73,Jason Friedberg,2006,2010,5,4,1.250000
169,Shawn Levy,2002,2014,11,12,0.916667
158,Robert Rodriguez,1992,2014,16,22,0.727273
1,Adam Shankman,2001,2012,8,11,0.727273